app/controllers/authors_controller.rb

SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 1]]
---
  def show
    @books= Book.where(author_id:@author.id)